#include "pch.h"
#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL, "Rus");
	cout << "Я помню чудное мгновенье:\n"
		<< "Передо мной явилась ты,\n"
		<< "Как мимолетное виденье,\n"
		<< "Как гений чистой красоты.\n"
		<< endl
		<< "В томленьях грусти безнадежной,\n"
		<< "В тревогах шумной суеты,\n"
		<< "Звучал мне долго голос нежный\n"
		<< "И снились милые черты.\n"
		<< endl
		<< "Шли годы. Бурь порыв мятежный\n"
		<< "Рассеял прежние мечты,\n"
		<< "И я забыл твой голос нежный,\n"
		<< "Твои небесные черты.\n"
		<< endl
		<< "В глуши, во мраке заточенья\n"
		<< "Тянулись тихо дни мои\n"
		<< "Без божества, без вдохновенья,\n"
		<< "Без слез, без жизни, без любви.\n"
		<< endl
		<< "Душе настало пробужденье:\n"
		<< "И вот опять явилась ты,\n"
		<< "Как мимолетное виденье,\n"
		<< "Как гений чистой красоты.\n"
		<< endl
		<< "И сердце бьется в упоенье,\n"
		<< "И для него воскресли вновь\n"
		<< "И божество, и вдохновенье,\n"
		<< "И жизнь, и слезы, и любовь.\n";
}